Revit 2026 API

# RadialArrayCreate(Document, View, ICollectionElementId, Int32, Line, Double, ArrayAnchorMember) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static RadialArray Create(
	Document aDoc,
	View dBView,
	ICollection<ElementId> ids,
	int count,
	Line axis,
	double angle,
	ArrayAnchorMember anchorMember
)
```
```vb
Public Shared Function Create (
	aDoc As Document,
	dBView As View,
	ids As ICollection(Of ElementId),
	count As Integer,
	axis As Line,
	angle As Double,
	anchorMember As ArrayAnchorMember
) As RadialArray
```
```cpp
public:
static RadialArray^ Create(
	Document^ aDoc,
	View^ dBView,
	ICollection<ElementId^>^ ids,
	int count,
	Line^ axis,
	double angle,
	ArrayAnchorMember anchorMember
)
```
```fsharp
static member Create :
        aDoc : Document *
        dBView : View *
        ids : ICollection<ElementId> *
        count : int *
        axis : Line *
        angle : float *
        anchorMember : ArrayAnchorMember -> RadialArray
```

#### Parameters

aDoc Document

dBView View

ids ICollectionElementId

count Int32

axis Line

angle Double

anchorMember ArrayAnchorMember

#### Return Value

RadialArray

#### Reference

RadialArray Class

Create Overload

Autodesk.Revit.DB Namespace